tutorials/multiphaseEuler/bed/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.air   1;
    alpha.water 0;
    alpha.solid 0;
}

zones
{
    bed
    {
        type        box;

        box         (0 0.3333 -0.1) (0.15 0.6501 0.1);

        values
        {
            alpha.air   0.4;
            alpha.water 0;
            alpha.solid 0.6;
        }
    }
}

// ************************************************************************* //
